app/views/voyages/index.html.erb

  <li class="list-group-item">
    <span class="badge"><%=  SiteAVisiter.where(:nom_voyage => voyage.nom).count %></span>
---
SELECT COUNT(*) FROM "site_a_visiters"  WHERE "site_a_visiters"."nom_voyage" = 'a'