app/views/site_a_visiters/index.html.erb

    <h4 class="list-group-item-heading"><%= site_a_visiter.nom_site %></h4>
    <p class="list-group-item-text"><%= Site.find_by(:nom => site_a_visiter.nom_site).categorie %></p>
---
SELECT  "sites".* FROM "sites"  WHERE "sites"."nom" = 'Marineland' LIMIT 1