app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

INSERT INTO "regions" ("created_at", "nom", "pays", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-19 20:03:59.014254"], ["nom", "PACA"], ["pays", "France"], ["updated_at", "2014-12-19 20:03:59.014254"]]
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save

UPDATE "regions" SET "nom" = ?, "pays" = ?, "updated_at" = ? WHERE "regions"."id" = 2  [["nom", "LanguedocRoussillon"], ["pays", "France"], ["updated_at", "2014-12-19 20:42:24.579970"]]
---
  def update
    respond_to do |format|
      if @region.update(region_params)

SELECT  "regions".* FROM "regions"  WHERE "regions"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_region
      @region = Region.find(params[:id])