app/controllers/site_a_visiters_controller.rb

  def index
    voyage=params[:voyage_nom];
    if voyage
      @site_a_visiters = SiteAVisiter.where(nom_voyage: voyage)
    else
    @site_a_visiters = SiteAVisiter.all
---
SELECT "site_a_visiters".* FROM "site_a_visiters"  WHERE "site_a_visiters"."nom_voyage" = 'a'
SELECT "site_a_visiters".* FROM "site_a_visiters"

  def create
    @site_a_visiter = SiteAVisiter.new(site_a_visiter_params)
    @site_a_visiter.save
---
INSERT INTO "site_a_visiters" ("created_at", "nom_site", "nom_voyage", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-02 15:31:47.885681"], ["nom_site", "Marineland"], ["nom_voyage", "a"], ["updated_at", "2015-01-02 15:31:47.885681"]]

  def update
    @site_a_visiter.update(site_a_visiter_params)
---
UPDATE "site_a_visiters" SET "nom_voyage" = ?, "updated_at" = ? WHERE "site_a_visiters"."id" = 5  [["nom_voyage", "it's_work"], ["updated_at", "2015-01-02 15:49:15.148599"]]

  def destroy
    nom = params[:voyage_nom]
    @site_a_visiter.destroy
---
DELETE FROM "site_a_visiters" WHERE "site_a_visiters"."id" = ?  [["id", 2]]

    def set_site_a_visiter
      @site_a_visiter = SiteAVisiter.find(params[:id])
---
SELECT  "site_a_visiters".* FROM "site_a_visiters"  WHERE "site_a_visiters"."id" = ? LIMIT 1  [["id", 5]]