app/controllers/sites_controller.rb

  def index
    categorie=params[:categorie]
    nom=params[:nom];
    region=params[:region_nom];
    if categorie
      @sites = Site.where(categorie: categorie)
    elsif nom
      @sites = Site.where(nom: nom)
    elsif region
      @sites = Site.where(region_nom: region)
    else
      @sites = Site.all
---
SELECT "sites".* FROM "sites"  WHERE "sites"."categorie" = 'musee'
SELECT "sites".* FROM "sites"  WHERE "sites"."nom" = 'm'
SELECT "sites".* FROM "sites"  WHERE "sites"."region_nom" = 'LanguedocRoussillon'
SELECT "sites".* FROM "sites"

  def search
     @sites = Site.where(categorie: params[:categorie])
---
SELECT "sites".* FROM "sites"  WHERE "sites"."categorie" IS NULL

  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save
---
INSERT INTO "sites" ("adresse", "audioguide", "avis", "categorie", "created_at", "description", "groupe", "guide", "image", "latitude", "longitude", "nom", "reduction", "region_nom", "tarif", "tel", "updated_at", "web") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @site.update(site_params)
---
UPDATE "sites" SET "image" = ?, "nom" = ?, "updated_at" = ? WHERE "sites"."id" = 5  [["image", "assets/marineland.jpg"], ["nom", "marineland"], ["updated_at", "2014-12-31 15:05:10.533599"]]

  def destroy
    @site.destroy
---
DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 2]]

    def set_site
      @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = ? LIMIT 1  [["id", 2]]