app/controllers/voyages_controller.rb

  def index
    user=params[:user_nom];
    if user
      @voyages = Voyage.where(user_nom: user)
    else
      @voyages = Voyage.all
---
SELECT "voyages".* FROM "voyages"  WHERE "voyages"."user_nom" = 'sophie.bernard.1811@gmail.com'
SELECT "voyages".* FROM "voyages"

  def create
    @voyage = Voyage.new(voyage_params)
    respond_to do |format|
      if @voyage.save
---
INSERT INTO "voyages" ("created_at", "nom", "updated_at", "user_nom") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-29 10:05:52.476077"], ["nom", "t"], ["updated_at", "2014-12-29 10:05:52.476077"], ["user_nom", ""]]

  def destroy
    @voyage.destroy
---
DELETE FROM "voyages" WHERE "voyages"."id" = ?  [["id", 2]]

    def set_voyage
      @voyage = Voyage.find(params[:id])
---
SELECT  "voyages".* FROM "voyages"  WHERE "voyages"."id" = ? LIMIT 1  [["id", 2]]